@srishtipmishra 

Really liked your idea of creating such a simple example. 

I got the following simple example working. 
```
resource "oci_core_vcn" "test_vcn" {
#Required
    cidr_block = "10.0.0.0/16"
    compartment_id = var.compartment_ocid
}

resource "oci_core_network_security_group" "test_network_security_group" {
#Required
    compartment_id = var.compartment_ocid
    vcn_id = oci_core_vcn.test_vcn.id
}

data "oci_core_network_security_groups" "test_network_security_groups" {
#Required
compartment_id = var.compartment_ocid
}

resource null_resource "MyNetWorkSecurityGroupList"  {
  count = length(data.oci_core_network_security_groups.test_network_security_groups.network_security_groups) 
  triggers = {
    id     = lookup(data.oci_core_network_security_groups.test_network_security_groups.network_security_groups[count.index], "id")
    name   = lookup(data.oci_core_network_security_groups.test_network_security_groups.network_security_groups[count.index], "display_name")
   }
}



output "network-security-group-map" {
  value = zipmap ( null_resource.MyNetWorkSecurityGroupList[*].triggers.name
                 , null_resource.MyNetWorkSecurityGroupList[*].triggers.id
                 ) 
}
```

Here is what happes with terraform
```
$ terraform apply
data.oci_core_network_security_groups.test_network_security_groups: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_core_network_security_group.test_network_security_group will be created
  + resource "oci_core_network_security_group" "test_network_security_group" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabosblablabla27yk5lhqt5cmwbinn2gma"
      + defined_tags   = (known after apply)
      + display_name   = (known after apply)
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_vcn.test_vcn will be created
  + resource "oci_core_vcn" "test_vcn" {
      + cidr_block               = "10.0.0.0/16"
      + cidr_blocks              = (known after apply)
      + compartment_id           = "ocid1.compartment.oc1..aaaaaaaabosblablabla27yk5lhqt5cmwbinn2gma"
      + default_dhcp_options_id  = (known after apply)
      + default_route_table_id   = (known after apply)
      + default_security_list_id = (known after apply)
      + defined_tags             = (known after apply)
      + display_name             = (known after apply)
      + dns_label                = (known after apply)
      + freeform_tags            = (known after apply)
      + id                       = (known after apply)
      + ipv6cidr_block           = (known after apply)
      + ipv6public_cidr_block    = (known after apply)
      + is_ipv6enabled           = (known after apply)
      + state                    = (known after apply)
      + time_created             = (known after apply)
      + vcn_domain_name          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_core_vcn.test_vcn: Creating...
oci_core_vcn.test_vcn: Creation complete after 1s [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaqdafwlblablablahz7cssxyqj56rp4t4lcdq]
oci_core_network_security_group.test_network_security_group: Creating...
oci_core_network_security_group.test_network_security_group: Creation complete after 0s [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaablablabla3bzda]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

network-security-group-map = {}
```
The network and a single NSG is created but the output is empty. 


```
prompt: /terraform_oci_testje
$ terraform apply
data.oci_core_network_security_groups.test_network_security_groups: Refreshing state...
oci_core_vcn.test_vcn: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaqdafwlblablablahz7cssxyqj56rp4t4lcdq]
oci_core_network_security_group.test_network_security_group: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaablablabla3bzda]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.MyNetWorkSecurityGroupList[0] will be created
  + resource "null_resource" "MyNetWorkSecurityGroupList" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaablablabla3bzda"
          + "name" = "networksecuritygroup20201113094713"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

null_resource.MyNetWorkSecurityGroupList[0]: Creating...
null_resource.MyNetWorkSecurityGroupList[0]: Creation complete after 0s [id=104669338835425637]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

network-security-group-map = {
  "networksecuritygroup20201113094713" = "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaablablabla3bzda"
}
```

second time we have actual data and now we see the output 

Why not the first time?